/*******************************************************************************
 *  电机驱动源文件
 *  直流有刷电机
 *  驱动器：DRV8801
 *******************************************************************************/ 
#include "drv_motor.h"
#include "bsp_drv8801.h"
#include "bsp_encoder.h"

motor_t motor_axis[3];

/************************************************************************
 * 函 数 名：drv_motor_enable
 * 功    能：全部电机使能运行
 * 输入参数：
 * 输出参数：
 * 返 回 值：
 * 作    者：XieFeng
 * 备    注：
************************************************************************/
void drv_motor_all_enable()
{	
  bsp_drv8801_all_enable();
}

/************************************************************************
 * 函 数 名：drv_motor_all_disable
 * 功    能：全部电机停止运行
 * 输入参数：
 * 输出参数：
 * 返 回 值：
 * 作    者：XieFeng
 * 备    注：
************************************************************************/
void drv_motor_all_disable()
{	
  bsp_drv8801_all_disable();
}

/************************************************************************
 * 函 数 名：drv_motor_set_pwm
 * 功    能：设置电机pwm值
 * 输入参数：MOTOR 枚举, pwm值
 * 输出参数：
 * 返 回 值：
 * 作    者：XieFeng
 * 备    注：
************************************************************************/
void drv_motor_set_pwm(motorID_t MOTOR, uint16_t pwm_val)
{
  bsp_drv8801_set_pwm(MOTOR, pwm_val);
}

/************************************************************************
 * 函 数 名：drv_motor_get_iq_value
 * 功    能：获取电机电流值 [0...2048]
 * 输入参数：MOTOR 枚举
 * 输出参数：电机电流值
 * 返 回 值：
 * 作    者：XieFeng
 * 备    注：
************************************************************************/
uint8_t drv_motor_get_iq_value(motorID_t MOTOR, uint16_t* motor_iq)
{
  
  return true;
}

/************************************************************************
 * 函 数 名：drv_Motor_PWM_Encoder_Start_Init
 * 功    能：电机驱动编码器初始化
 * 输入参数：
 * 输出参数：
 * 返 回 值：
 * 作    者：XieFeng
 * 备    注：
************************************************************************/
void drv_Motor_PWM_Encoder_Start_Init()
{
  bsp_Encoder_Start_Init();
  bsp_DRV8801_PWM_Enable_Init();
}

/************************************************************************
 * 函 数 名：	get_motor_axis_data_pointer
 * 功    能： 获取motor_axis的地址指针
 * 输入参数：	
 * 输出参数：		
 * 返 回 值： motor_axis的地址指针
 * 作    者：	XieFeng
 * 备    注：
************************************************************************/
motor_t* get_motor_axis_data_pointer(void)
{
	return &motor_axis[0];
}
